ErichStyger/mcuoneclipse/Examples/MCUXpresso/LPC55S69-EVK/LPC55S69_RS-485/board/pin_mux.h
/*! @name USB0_DP (number 97), P10[3]/D10[3]/USB0_FS_P
  @{ */
/* Routed pin properties */
#define BOARD_INITUSBPINS_USB0_DP_PERIPHERAL USBFSH               /*!<@brief Peripheral name */
#define BOARD_INITUSBPINS_USB0_DP_SIGNAL USB_DP                   /*!<@brief Signal name */
#define BOARD_INITUSBPINS_USB0_DP_PIN_NAME USB0_DP                /*!<@brief Routed pin name */
#define BOARD_INITUSBPINS_USB0_DP_LABEL "P10[3]/D10[3]/USB0_FS_P" /*!<@brief Label */
#define BOARD_INITUSBPINS_USB0_DP_NAME "USB0_DP"                  /*!<@brief Identifier */
                                                                  /* @} */

/*! @name USB0_DM (number 98), P10[2]/D10[2]/USB0_FS_N
  @{ */
/* Routed pin properties */
#define BOARD_INITUSBPINS_USB0_DM_PERIPHERAL USBFSH               /*!<@brief Peripheral name */
#define BOARD_INITUSBPINS_USB0_DM_SIGNAL USB_DM                   /*!<@brief Signal name */
#define BOARD_INITUSBPINS_USB0_DM_PIN_NAME USB0_DM                /*!<@brief Routed pin name */
#define BOARD_INITUSBPINS_USB0_DM_LABEL "P10[2]/D10[2]/USB0_FS_N" /*!<@brief Label */
#define BOARD_INITUSBPINS_USB0_DM_NAME "USB0_DM"                  /*!<@brief Identifier */
                                                                  /* @} */

/*! @name PIO0_22 (number 78), P10[1]/USB0_VBUS
  @{ */
/* Routed pin properties */
#define BOARD_INITUSBPINS_USB0_VBUS_PERIPHERAL USBFSH         /*!<@brief Peripheral name */
#define BOARD_INITUSBPINS_USB0_VBUS_SIGNAL USB_VBUS           /*!<@brief Signal name */
#define BOARD_INITUSBPINS_USB0_VBUS_PIN_NAME USB0_VBUS        /*!<@brief Routed pin name */
#define BOARD_INITUSBPINS_USB0_VBUS_LABEL "P10[1]/USB0_VBUS"  /*!<@brief Label */
#define BOARD_INITUSBPINS_USB0_VBUS_NAME "USB0_VBUS"          /*!<@brief Identifier */
#define BOARD_INITUSBPINS_USB0_VBUS_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITUSBPINS_USB0_VBUS_PIN 22U                   /*!<@brief PORT pin number */
#define BOARD_INITUSBPINS_USB0_VBUS_PIN_MASK (1U << 22U)      /*!<@brief PORT pin mask */
                                                              /* @} */

/*! @name USB1_DM (number 35), P9[2]/D9[2]/USB1_HS_N
  @{ */
/* Routed pin properties */
#define BOARD_INITUSBPINS_USB1_DM_PERIPHERAL USBHSH             /*!<@brief Peripheral name */
#define BOARD_INITUSBPINS_USB1_DM_SIGNAL USB_DM                 /*!<@brief Signal name */
#define BOARD_INITUSBPINS_USB1_DM_PIN_NAME USB1_DM              /*!<@brief Routed pin name */
#define BOARD_INITUSBPINS_USB1_DM_LABEL "P9[2]/D9[2]/USB1_HS_N" /*!<@brief Label */
#define BOARD_INITUSBPINS_USB1_DM_NAME "USB1_DM"                /*!<@brief Identifier */
                                                                /* @} */

/*! @name USB1_DP (number 34), P9[3]/D9[3]/USB1_HS_P
  @{ */
/* Routed pin properties */
#define BOARD_INITUSBPINS_USB1_DP_PERIPHERAL USBHSH             /*!<@brief Peripheral name */
#define BOARD_INITUSBPINS_USB1_DP_SIGNAL USB_DP                 /*!<@brief Signal name */
#define BOARD_INITUSBPINS_USB1_DP_PIN_NAME USB1_DP              /*!<@brief Routed pin name */
#define BOARD_INITUSBPINS_USB1_DP_LABEL "P9[3]/D9[3]/USB1_HS_P" /*!<@brief Label */
#define BOARD_INITUSBPINS_USB1_DP_NAME "USB1_DP"                /*!<@brief Identifier */
                                                                /* @} */

/*! @name USB1_VBUS (number 36), P9[1]/USB1_VBUS
  @{ */
/* Routed pin properties */
#define BOARD_INITUSBPINS_USB1_VBUS_PERIPHERAL USBHSH       /*!<@brief Peripheral name */
#define BOARD_INITUSBPINS_USB1_VBUS_SIGNAL USB_VBUS         /*!<@brief Signal name */
#define BOARD_INITUSBPINS_USB1_VBUS_PIN_NAME USB1_VBUS      /*!<@brief Routed pin name */
#define BOARD_INITUSBPINS_USB1_VBUS_LABEL "P9[1]/USB1_VBUS" /*!<@brief Label */
#define BOARD_INITUSBPINS_USB1_VBUS_NAME "USB1_VBUS"        /*!<@brief Identifier */
                                                            /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitUSBPins(void); /* Function assigned for the Cortex-M33 (Core #0) */

#define IOCON_PIO_DIGITAL_EN 0x0100u  /*!<@brief Enables digital function */
#define IOCON_PIO_FUNC0 0x00u         /*!<@brief Selects pin function 0 */
#define IOCON_PIO_INV_DI 0x00u        /*!<@brief Input function is not inverted */
#define IOCON_PIO_MODE_PULLUP 0x20u   /*!<@brief Selects pull-up function */
#define IOCON_PIO_OPENDRAIN_DI 0x00u  /*!<@brief Open drain is disabled */
#define IOCON_PIO_SLEW_STANDARD 0x00u /*!<@brief Standard mode, output slew rate control is enabled */

/*! @name PIO1_4 (number 1), R78/P18[5]/LEDR/PWM_ARD
  @{ */
/* Routed pin properties */
#define BOARD_INITLEDSPINS_LED_BULE_PERIPHERAL GPIO                    /*!<@brief Peripheral name */
#define BOARD_INITLEDSPINS_LED_BULE_SIGNAL PIO1                        /*!<@brief Signal name */
#define BOARD_INITLEDSPINS_LED_BULE_CHANNEL 4                          /*!<@brief Signal channel */
#define BOARD_INITLEDSPINS_LED_BULE_PIN_NAME PIO1_4                    /*!<@brief Routed pin name */
#define BOARD_INITLEDSPINS_LED_BULE_LABEL "R78/P18[5]/LEDR/PWM_ARD"    /*!<@brief Label */
#define BOARD_INITLEDSPINS_LED_BULE_NAME "LED_BULE"                    /*!<@brief Identifier */
#define BOARD_INITLEDSPINS_LED_BULE_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */

/* Symbols to be used with GPIO driver */
#define BOARD_INITLEDSPINS_LED_BULE_GPIO GPIO                          /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITLEDSPINS_LED_BULE_GPIO_PIN 4U                        /*!<@brief GPIO pin number */
#define BOARD_INITLEDSPINS_LED_BULE_GPIO_PIN_MASK (1U << 4U)           /*!<@brief GPIO pin mask */
#define BOARD_INITLEDSPINS_LED_BULE_PORT 1U                            /*!<@brief PORT peripheral base pointer */
#define BOARD_INITLEDSPINS_LED_BULE_PIN 4U                             /*!<@brief PORT pin number */
#define BOARD_INITLEDSPINS_LED_BULE_PIN_MASK (1U << 4U)                /*!<@brief PORT pin mask */
                                                                       /* @} */

/*! @name PIO1_6 (number 5), R80/P18[9]/LEDB/PWM_ARD
  @{ */
/* Routed pin properties */
#define BOARD_INITLEDSPINS_LED_RED_PERIPHERAL GPIO                    /*!<@brief Peripheral name */
#define BOARD_INITLEDSPINS_LED_RED_SIGNAL PIO1                        /*!<@brief Signal name */
#define BOARD_INITLEDSPINS_LED_RED_CHANNEL 6                          /*!<@brief Signal channel */
#define BOARD_INITLEDSPINS_LED_RED_PIN_NAME PIO1_6                    /*!<@brief Routed pin name */
#define BOARD_INITLEDSPINS_LED_RED_LABEL "R80/P18[9]/LEDB/PWM_ARD"    /*!<@brief Label */
#define BOARD_INITLEDSPINS_LED_RED_NAME "LED_RED"                     /*!<@brief Identifier */
#define BOARD_INITLEDSPINS_LED_RED_DIRECTION kPIN_MUX_DirectionOutput /*!<@brief Direction */

