ErichStyger/mcuoneclipse/Examples/MCUXpresso/LPC55S69-EVK/LPC55S69_RS-485/board/pin_mux.h
/* Symbols to be used with GPIO driver */
#define BOARD_INITBUTTONSPINS_S3_GPIO GPIO                         /*!<@brief GPIO peripheral base pointer */
#define BOARD_INITBUTTONSPINS_S3_GPIO_PIN 9U                       /*!<@brief GPIO pin number */
#define BOARD_INITBUTTONSPINS_S3_GPIO_PIN_MASK (1U << 9U)          /*!<@brief GPIO pin mask */
#define BOARD_INITBUTTONSPINS_S3_PORT 1U                           /*!<@brief PORT peripheral base pointer */
#define BOARD_INITBUTTONSPINS_S3_PIN 9U                            /*!<@brief PORT pin number */
#define BOARD_INITBUTTONSPINS_S3_PIN_MASK (1U << 9U)               /*!<@brief PORT pin mask */
                                                                   /* @} */

/*! @name RESETN (number 32), S4/P16[10]/P23[2]/U14[8]/RESETN
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITBUTTONSPINS_S4_PERIPHERAL SYSCON
/*!
 * @brief Signal name */
#define BOARD_INITBUTTONSPINS_S4_SIGNAL RESET
/*!
 * @brief Routed pin name */
#define BOARD_INITBUTTONSPINS_S4_PIN_NAME RESETN
/*!
 * @brief Label */
#define BOARD_INITBUTTONSPINS_S4_LABEL "S4/P16[10]/P23[2]/U14[8]/RESETN"
/*!
 * @brief Identifier */
#define BOARD_INITBUTTONSPINS_S4_NAME "S4"
/* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitBUTTONsPins(void); /* Function assigned for the Cortex-M33 (Core #0) */

#define IOCON_PIO_ASW_EN 0x0400u      /*!<@brief Analog switch is closed (enabled) */
#define IOCON_PIO_DIGITAL_EN 0x0100u  /*!<@brief Enables digital function */
#define IOCON_PIO_FUNC1 0x01u         /*!<@brief Selects pin function 1 */
#define IOCON_PIO_FUNC2 0x02u         /*!<@brief Selects pin function 2 */
#define IOCON_PIO_FUNC5 0x05u         /*!<@brief Selects pin function 5 */
#define IOCON_PIO_FUNC7 0x07u         /*!<@brief Selects pin function 7 */
#define IOCON_PIO_INV_DI 0x00u        /*!<@brief Input function is not inverted */
#define IOCON_PIO_MODE_INACT 0x00u    /*!<@brief No addition pin function */
#define IOCON_PIO_MODE_PULLUP 0x20u   /*!<@brief Selects pull-up function */
#define IOCON_PIO_OPENDRAIN_DI 0x00u  /*!<@brief Open drain is disabled */
#define IOCON_PIO_SLEW_STANDARD 0x00u /*!<@brief Standard mode, output slew rate control is enabled */

/*! @name PIO1_20 (number 4), P17[1]/P24[5]/FC4_I2C_SCL_ARD
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITI2SPINS_FC4_I2C_SCL_PERIPHERAL FLEXCOMM4
/*!
 * @brief Signal name */
#define BOARD_INITI2SPINS_FC4_I2C_SCL_SIGNAL TXD_SCL_MISO_WS
/*!
 * @brief Routed pin name */
#define BOARD_INITI2SPINS_FC4_I2C_SCL_PIN_NAME FC4_TXD_SCL_MISO_WS
/*!
 * @brief Label */
#define BOARD_INITI2SPINS_FC4_I2C_SCL_LABEL "P17[1]/P24[5]/FC4_I2C_SCL_ARD"
/*!
 * @brief Identifier */
#define BOARD_INITI2SPINS_FC4_I2C_SCL_NAME "FC4_I2C_SCL"
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITI2SPINS_FC4_I2C_SCL_PORT 1U
/*!
 * @brief PORT pin number */
#define BOARD_INITI2SPINS_FC4_I2C_SCL_PIN 20U
/*!
 * @brief PORT pin mask */
#define BOARD_INITI2SPINS_FC4_I2C_SCL_PIN_MASK (1U << 20U)
/* @} */

/*! @name PIO1_21 (number 30), P17[3]/P24[6]/FC4_I2C_SDA_ARD
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITI2SPINS_FC4_I2C_SDA_PERIPHERAL FLEXCOMM4
/*!
 * @brief Signal name */
#define BOARD_INITI2SPINS_FC4_I2C_SDA_SIGNAL RXD_SDA_MOSI_DATA
/*!
 * @brief Routed pin name */
#define BOARD_INITI2SPINS_FC4_I2C_SDA_PIN_NAME FC4_RXD_SDA_MOSI_DATA
/*!
 * @brief Label */
#define BOARD_INITI2SPINS_FC4_I2C_SDA_LABEL "P17[3]/P24[6]/FC4_I2C_SDA_ARD"
/*!
 * @brief Identifier */
#define BOARD_INITI2SPINS_FC4_I2C_SDA_NAME "FC4_I2C_SDA"
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITI2SPINS_FC4_I2C_SDA_PORT 1U
/*!
 * @brief PORT pin number */
#define BOARD_INITI2SPINS_FC4_I2C_SDA_PIN 21U
/*!
 * @brief PORT pin mask */
#define BOARD_INITI2SPINS_FC4_I2C_SDA_PIN_MASK (1U << 21U)
/* @} */

/*! @name PIO1_31 (number 91), P19[7]/P19[8]/PLU_IN0/GPIO
  @{ */
/* Routed pin properties */
#define BOARD_INITI2SPINS_MCLK_PERIPHERAL SYSCON                  /*!<@brief Peripheral name */
#define BOARD_INITI2SPINS_MCLK_SIGNAL MCLK                        /*!<@brief Signal name */
#define BOARD_INITI2SPINS_MCLK_PIN_NAME MCLK                      /*!<@brief Routed pin name */
#define BOARD_INITI2SPINS_MCLK_LABEL "P19[7]/P19[8]/PLU_IN0/GPIO" /*!<@brief Label */
#define BOARD_INITI2SPINS_MCLK_NAME "MCLK"                        /*!<@brief Identifier */
#define BOARD_INITI2SPINS_MCLK_PORT 1U                            /*!<@brief PORT peripheral base pointer */
#define BOARD_INITI2SPINS_MCLK_PIN 31U                            /*!<@brief PORT pin number */
#define BOARD_INITI2SPINS_MCLK_PIN_MASK (1U << 31U)               /*!<@brief PORT pin mask */
                                                                  /* @} */

/*! @name PIO0_21 (number 76), P17[14]/FC7_I2S_SCK
  @{ */
/* Routed pin properties */
#define BOARD_INITI2SPINS_FC7_I2S_SCK_PERIPHERAL FLEXCOMM7        /*!<@brief Peripheral name */
#define BOARD_INITI2SPINS_FC7_I2S_SCK_SIGNAL SCK                  /*!<@brief Signal name */
#define BOARD_INITI2SPINS_FC7_I2S_SCK_PIN_NAME FC7_SCK            /*!<@brief Routed pin name */
#define BOARD_INITI2SPINS_FC7_I2S_SCK_LABEL "P17[14]/FC7_I2S_SCK" /*!<@brief Label */
#define BOARD_INITI2SPINS_FC7_I2S_SCK_NAME "FC7_I2S_SCK"          /*!<@brief Identifier */
#define BOARD_INITI2SPINS_FC7_I2S_SCK_PORT 0U                     /*!<@brief PORT peripheral base pointer */
#define BOARD_INITI2SPINS_FC7_I2S_SCK_PIN 21U                     /*!<@brief PORT pin number */
#define BOARD_INITI2SPINS_FC7_I2S_SCK_PIN_MASK (1U << 21U)        /*!<@brief PORT pin mask */
                                                                  /* @} */

/*! @name PIO0_20 (number 74), P17[10]/FC7_I2S_TX
  @{ */
/* Routed pin properties */
#define BOARD_INITI2SPINS_FC7_I2S_TX_PERIPHERAL FLEXCOMM7           /*!<@brief Peripheral name */
#define BOARD_INITI2SPINS_FC7_I2S_TX_SIGNAL RXD_SDA_MOSI_DATA       /*!<@brief Signal name */
#define BOARD_INITI2SPINS_FC7_I2S_TX_PIN_NAME FC7_RXD_SDA_MOSI_DATA /*!<@brief Routed pin name */
#define BOARD_INITI2SPINS_FC7_I2S_TX_LABEL "P17[10]/FC7_I2S_TX"     /*!<@brief Label */
#define BOARD_INITI2SPINS_FC7_I2S_TX_NAME "FC7_I2S_TX"              /*!<@brief Identifier */
#define BOARD_INITI2SPINS_FC7_I2S_TX_PORT 0U                        /*!<@brief PORT peripheral base pointer */
#define BOARD_INITI2SPINS_FC7_I2S_TX_PIN 20U                        /*!<@brief PORT pin number */
#define BOARD_INITI2SPINS_FC7_I2S_TX_PIN_MASK (1U << 20U)           /*!<@brief PORT pin mask */
                                                                    /* @} */

