ErichStyger/mcuoneclipse/Examples/MCUXpresso/LPC55S69-EVK/LPC55S69_RS-485/board/pin_mux.h
/*! @name PIO0_19 (number 90), P17[12]/FC7_I2S_WS
  @{ */
/* Routed pin properties */
#define BOARD_INITI2SPINS_FC7_I2S_WS_PERIPHERAL FLEXCOMM7         /*!<@brief Peripheral name */
#define BOARD_INITI2SPINS_FC7_I2S_WS_SIGNAL TXD_SCL_MISO_WS       /*!<@brief Signal name */
#define BOARD_INITI2SPINS_FC7_I2S_WS_PIN_NAME FC7_TXD_SCL_MISO_WS /*!<@brief Routed pin name */
#define BOARD_INITI2SPINS_FC7_I2S_WS_LABEL "P17[12]/FC7_I2S_WS"   /*!<@brief Label */
#define BOARD_INITI2SPINS_FC7_I2S_WS_NAME "FC7_I2S_WS"            /*!<@brief Identifier */
#define BOARD_INITI2SPINS_FC7_I2S_WS_PORT 0U                      /*!<@brief PORT peripheral base pointer */
#define BOARD_INITI2SPINS_FC7_I2S_WS_PIN 19U                      /*!<@brief PORT pin number */
#define BOARD_INITI2SPINS_FC7_I2S_WS_PIN_MASK (1U << 19U)         /*!<@brief PORT pin mask */
                                                                  /* @} */

/*! @name PIO0_10 (number 21), U14[12]/SWO_TRGT
  @{ */
/* Routed pin properties */
#define BOARD_INITI2SPINS_FC6_I2S_CLK_PERIPHERAL FLEXCOMM6      /*!<@brief Peripheral name */
#define BOARD_INITI2SPINS_FC6_I2S_CLK_SIGNAL SCK                /*!<@brief Signal name */
#define BOARD_INITI2SPINS_FC6_I2S_CLK_PIN_NAME FC6_SCK          /*!<@brief Routed pin name */
#define BOARD_INITI2SPINS_FC6_I2S_CLK_LABEL "U14[12]/SWO_TRGT"  /*!<@brief Label */
#define BOARD_INITI2SPINS_FC6_I2S_CLK_NAME "FC6_I2S_CLK"        /*!<@brief Identifier */
#define BOARD_INITI2SPINS_FC6_I2S_CLK_PORT 0U                   /*!<@brief PORT peripheral base pointer */
#define BOARD_INITI2SPINS_FC6_I2S_CLK_PIN 10U                   /*!<@brief PORT pin number */
#define BOARD_INITI2SPINS_FC6_I2S_CLK_PIN_MASK (1U << 10U)      /*!<@brief PORT pin mask */
                                                                /* @} */

/*! @name PIO1_13 (number 2), P17[20]/FC6_I2S_RX
  @{ */
/* Routed pin properties */
#define BOARD_INITI2SPINS_FC6_I2S_RX_PERIPHERAL FLEXCOMM6           /*!<@brief Peripheral name */
#define BOARD_INITI2SPINS_FC6_I2S_RX_SIGNAL RXD_SDA_MOSI_DATA       /*!<@brief Signal name */
#define BOARD_INITI2SPINS_FC6_I2S_RX_PIN_NAME FC6_RXD_SDA_MOSI_DATA /*!<@brief Routed pin name */
#define BOARD_INITI2SPINS_FC6_I2S_RX_LABEL "P17[20]/FC6_I2S_RX"     /*!<@brief Label */
#define BOARD_INITI2SPINS_FC6_I2S_RX_NAME "FC6_I2S_RX"              /*!<@brief Identifier */
#define BOARD_INITI2SPINS_FC6_I2S_RX_PORT 1U                        /*!<@brief PORT peripheral base pointer */
#define BOARD_INITI2SPINS_FC6_I2S_RX_PIN 13U                        /*!<@brief PORT pin number */
#define BOARD_INITI2SPINS_FC6_I2S_RX_PIN_MASK (1U << 13U)           /*!<@brief PORT pin mask */
                                                                    /* @} */

/*! @name PIO1_16 (number 87), P18[17]/SD1_PWR_EN
  @{ */
/* Routed pin properties */
#define BOARD_INITI2SPINS_FC6_I2S_WS_PERIPHERAL FLEXCOMM6         /*!<@brief Peripheral name */
#define BOARD_INITI2SPINS_FC6_I2S_WS_SIGNAL TXD_SCL_MISO_WS       /*!<@brief Signal name */
#define BOARD_INITI2SPINS_FC6_I2S_WS_PIN_NAME FC6_TXD_SCL_MISO_WS /*!<@brief Routed pin name */
#define BOARD_INITI2SPINS_FC6_I2S_WS_LABEL "P18[17]/SD1_PWR_EN"   /*!<@brief Label */
#define BOARD_INITI2SPINS_FC6_I2S_WS_NAME "FC6_I2S_WS"            /*!<@brief Identifier */
#define BOARD_INITI2SPINS_FC6_I2S_WS_PORT 1U                      /*!<@brief PORT peripheral base pointer */
#define BOARD_INITI2SPINS_FC6_I2S_WS_PIN 16U                      /*!<@brief PORT pin number */
#define BOARD_INITI2SPINS_FC6_I2S_WS_PIN_MASK (1U << 16U)         /*!<@brief PORT pin mask */
                                                                  /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitI2SPins(void); /* Function assigned for the Cortex-M33 (Core #0) */

#define IOCON_PIO_ASW_DI 0x00u        /*!<@brief Analog switch is open (disabled) */
#define IOCON_PIO_DIGITAL_EN 0x0100u  /*!<@brief Enables digital function */
#define IOCON_PIO_FUNC0 0x00u         /*!<@brief Selects pin function 0 */
#define IOCON_PIO_FUNC5 0x05u         /*!<@brief Selects pin function 5 */
#define IOCON_PIO_INV_DI 0x00u        /*!<@brief Input function is not inverted */
#define IOCON_PIO_MODE_INACT 0x00u    /*!<@brief No addition pin function */
#define IOCON_PIO_MODE_PULLUP 0x20u   /*!<@brief Selects pull-up function */
#define IOCON_PIO_OPENDRAIN_DI 0x00u  /*!<@brief Open drain is disabled */
#define IOCON_PIO_SLEW_STANDARD 0x00u /*!<@brief Standard mode, output slew rate control is enabled */

/*! @name PIO1_21 (number 30), P17[3]/P24[6]/FC4_I2C_SDA_ARD
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITACCELPINS_FC4_I2C_SDA_PERIPHERAL FLEXCOMM4
/*!
 * @brief Signal name */
#define BOARD_INITACCELPINS_FC4_I2C_SDA_SIGNAL RXD_SDA_MOSI_DATA
/*!
 * @brief Routed pin name */
#define BOARD_INITACCELPINS_FC4_I2C_SDA_PIN_NAME FC4_RXD_SDA_MOSI_DATA
/*!
 * @brief Label */
#define BOARD_INITACCELPINS_FC4_I2C_SDA_LABEL "P17[3]/P24[6]/FC4_I2C_SDA_ARD"
/*!
 * @brief Identifier */
#define BOARD_INITACCELPINS_FC4_I2C_SDA_NAME "FC4_I2C_SDA"
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITACCELPINS_FC4_I2C_SDA_PORT 1U
/*!
 * @brief PORT pin number */
#define BOARD_INITACCELPINS_FC4_I2C_SDA_PIN 21U
/*!
 * @brief PORT pin mask */
#define BOARD_INITACCELPINS_FC4_I2C_SDA_PIN_MASK (1U << 21U)
/* @} */

/*! @name PIO1_20 (number 4), P17[1]/P24[5]/FC4_I2C_SCL_ARD
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITACCELPINS_FC4_I2C_SCL_PERIPHERAL FLEXCOMM4
/*!
 * @brief Signal name */
#define BOARD_INITACCELPINS_FC4_I2C_SCL_SIGNAL TXD_SCL_MISO_WS
/*!
 * @brief Routed pin name */
#define BOARD_INITACCELPINS_FC4_I2C_SCL_PIN_NAME FC4_TXD_SCL_MISO_WS
/*!
 * @brief Label */
#define BOARD_INITACCELPINS_FC4_I2C_SCL_LABEL "P17[1]/P24[5]/FC4_I2C_SCL_ARD"
/*!
 * @brief Identifier */
#define BOARD_INITACCELPINS_FC4_I2C_SCL_NAME "FC4_I2C_SCL"
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITACCELPINS_FC4_I2C_SCL_PORT 1U
/*!
 * @brief PORT pin number */
#define BOARD_INITACCELPINS_FC4_I2C_SCL_PIN 20U
/*!
 * @brief PORT pin mask */
#define BOARD_INITACCELPINS_FC4_I2C_SCL_PIN_MASK (1U << 20U)
/* @} */

/*! @name PIO1_19 (number 58), U7[3]/P18[14]/PLU_OUT1/GPIO
  @{ */
/* Routed pin properties */
/*!
 * @brief Peripheral name */
#define BOARD_INITACCELPINS_ACCL_INTR_PERIPHERAL GPIO
/*!
 * @brief Signal name */
#define BOARD_INITACCELPINS_ACCL_INTR_SIGNAL PIO1
/*!
 * @brief Signal channel */
#define BOARD_INITACCELPINS_ACCL_INTR_CHANNEL 19
/*!
 * @brief Routed pin name */
#define BOARD_INITACCELPINS_ACCL_INTR_PIN_NAME PIO1_19
/*!
 * @brief Label */
#define BOARD_INITACCELPINS_ACCL_INTR_LABEL "U7[3]/P18[14]/PLU_OUT1/GPIO"
/*!
 * @brief Identifier */
#define BOARD_INITACCELPINS_ACCL_INTR_NAME "ACCL_INTR"
/*!
 * @brief Direction */
#define BOARD_INITACCELPINS_ACCL_INTR_DIRECTION kPIN_MUX_DirectionInput

/* Symbols to be used with GPIO driver */
/*!
 * @brief GPIO peripheral base pointer */
#define BOARD_INITACCELPINS_ACCL_INTR_GPIO GPIO
/*!
 * @brief GPIO pin number */
#define BOARD_INITACCELPINS_ACCL_INTR_GPIO_PIN 19U
/*!
 * @brief GPIO pin mask */
#define BOARD_INITACCELPINS_ACCL_INTR_GPIO_PIN_MASK (1U << 19U)
/*!
 * @brief PORT peripheral base pointer */
#define BOARD_INITACCELPINS_ACCL_INTR_PORT 1U
/*!
 * @brief PORT pin number */
#define BOARD_INITACCELPINS_ACCL_INTR_PIN 19U
/*!
 * @brief PORT pin mask */
#define BOARD_INITACCELPINS_ACCL_INTR_PIN_MASK (1U << 19U)
/* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitACCELPins(void); /* Function assigned for the Cortex-M33 (Core #0) */

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
